// pages/article01/article01.js
const app = getApp();
Page({
  data: {
    article: {
      title: "清明小长假假期",
      imgUrl: "../images/article/qingming.png",
      content: "清明，给人的印象总是一片湿雨。仿佛有了这雨，清明才更能显得出它淡淡悲凉和丝丝忆念的味道来。是清明成全了这场雨，更是这雨衬托了清明。望着飘洒的细雨，才更能引得人们心中那种淡淡的哀愁和思。\n \n这雨或是风狂雨恣，或是和风细雨，从清晨开始，至黄昏之际，在烟雨弥漫的山野中，在泥泞难行的小路上，总有顶风冒雨，点缀寂寥，行行重行行的扫墓人；或三五成群，扶老携幼，或一二个孤影，跚跚独行。远山隐在云雾里，近树笼在孤烟前，小桥流水，愁鸦悲啼，雨洗清秋，风吹哀愁，唯见烟雨一片苍茫，不见人家与炊烟。\n \n好一个伤感寂寥的行旅，好一个凄迷彷徨的画面。抬头偶望，墓地黯然见：百坟拱起，千碑林立；烟雨朦朦，青草何离离。一片荒凉，一片凄迷，一片死寂！\n \n 山孤烟雾薄，树小雨声稀！风飘飘，雨潇潇，哀思悠悠，悲情渺渺，莫道不销魂，何处暗香盈袖？拔净一片乱草，摆下几杯冷酒，烧上一把纸钱，风雨愁煞人，杯土带愁，杂草含烟，竟无言以对，唯有心底弥满幽幽的愁绪和淡淡的哀愁！\n \n死者长已矣，存者永怀悲！音容笑貌，历历在目，昔日种种，犹言在耳，但客心逐流水，随缘到天涯，念千里孤坟何处话凄凉？"
    },
    likeList: app.globalData.likeList
  }
})